smartmeio/arancino-core-samd21/boards.txt
# SPDX-license-identifier: Apache-2.0
#
# Copyright (c) 2019 smartme.io
#
# Authors:  Sergio Tomasello <sergio@smartme.io>
# Authors:  Andrea Cannistrà <andrea@smartme.io>
#
# Licensed under the Apache License, Version 2.0 (the "License"); you may
# not use this file except in compliance with the License. You may obtain
# a copy of the License at
#
# http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
# WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the
# License for the specific language governing permissions and limitations
# under the License.

# Arancino Mignon (Native USB Port)
# ---------------------------------------
arancino_mignon.name=Arancino Mignon
arancino_mignon.upload.via_ssh=true
arancino_mignon.vid.0=0x04D8
arancino_mignon.pid.0=0xECD9

arancino_mignon.upload.tool=bossac
arancino_mignon.upload.protocol=sam-ba
arancino_mignon.upload.maximum_size=262144
arancino_mignon.upload.use_1200bps_touch=true
arancino_mignon.upload.wait_for_upload_port=true
arancino_mignon.upload.native_usb=true
arancino_mignon.build.mcu=cortex-m0plus
arancino_mignon.build.f_cpu=48000000L
arancino_mignon.build.usb_product="Arancino Mignon"
arancino_mignon.build.usb_manufacturer="smartme.IO"
arancino_mignon.build.board=SAMD_ZERO
arancino_mignon.build.core=arancino
arancino_mignon.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
arancino_mignon.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arancino_mignon.build.openocdscript=openocd_scripts/arduino_zero.cfg
arancino_mignon.build.variant=arancino
arancino_mignon.build.variant_system_lib=
arancino_mignon.build.vid=0x04D8
arancino_mignon.build.pid=0xECD9
arancino_mignon.bootloader.tool=openocd
arancino_mignon.bootloader.file=arancino/samd21_sam_ba_arancino_mignon.bin

# Arancino (Native USB Port)
# ---------------------------------------
arancino.name=Arancino
arancino.upload.via_ssh=true
arancino.vid.0=0x04D8
arancino.pid.0=0xECDA

arancino.upload.tool=bossac
arancino.upload.protocol=sam-ba
arancino.upload.maximum_size=262144
arancino.upload.use_1200bps_touch=true
arancino.upload.wait_for_upload_port=true
arancino.upload.native_usb=true
arancino.build.mcu=cortex-m0plus
arancino.build.f_cpu=48000000L
arancino.build.usb_product="Arancino"
arancino.build.usb_manufacturer="smartme.IO"
arancino.build.board=SAMD_ZERO
arancino.build.core=arancino
arancino.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
arancino.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arancino.build.variant=arancino
arancino.build.variant_system_lib=
arancino.build.vid=0x04D8
arancino.build.pid=0xECDA
arancino.bootloader.tool=openocd
arancino.bootloader.file=arancino/samd21_sam_ba_arancino.bin
